In [13]:
import pandas as pd

data = {
    'Name': ['Bhuvi', 'ramcharan', 'mlagarithaluka'],
    'Age': [24,175, 21,],
    'City': ['India', 'Hyderabad', 'pitapuram']
}
df = pd.DataFrame(data)

df

             Name  Age       City
0           Bhuvi   24      India
1       ramcharan  175  Hyderabad
2  mlagarithaluka   21  pitapuram

In [15]:
df.head()

             Name  Age       City
0           Bhuvi   24      India
1       ramcharan  175  Hyderabad
2  mlagarithaluka   21  pitapuram

In [17]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
df['Name']

0             Bhuvi
1         ramcharan
2    mlagarithaluka
Name: Name, dtype: object

In [21]:

df.iloc[0]

Name    Bhuvi
Age        24
City    India
Name: 0, dtype: object

In [25]:

data_dict = [
    {'Name': 'bhuvi', 'Age': 24, 'City': 'India'},
    {'Name': 'ramcharan', 'Age': 175, 'City': 'Hyderabad'},
    {'Name': 'mlagarithaluka', 'Age': 21, 'City': 'pitaphuram'}
]
df_dict = pd.DataFrame(data_dict)

df_dict

             Name  Age        City
0           bhuvi   24       India
1       ramcharan  175   Hyderabad
2  mlagarithaluka   21  pitaphuram

In [27]:
df.to_csv('data.csv', index=False)

In [ ]:
1.Interactive data visualizations can be developed and improved repeatedly by producers with the use of the "write/render/evaluate" loop.
They may write the code to produce the visualization, render it to see how it appears, and assess its efficacy thanks to this loop.
Artists can refine their visuals for greater impact and clarity by going through this process again.

2.Users can interact with data in a more personalized way with the help of dynamic, interactive data visualizations.
They provide consumers the opportunity to engage with diverse data points, investigate various aspects of the data, 
and obtain insights catered to their particular queries or passions.

3.Murray makes the point that open-source software is frequently superior for disseminating data visualizations, and I agree.
Increased transparency and flexibility are offered by open-source tools, which let users modify and alter their 
visualizations without being constrained by proprietary software. Furthermore, open-source solutions encourage teamwork in
an atmosphere where consumers can gain from innovations and enhancements driven by the community.